app/controllers/users_controller.rb

def index
	@title = "All users"
    @users = User.all
---
SELECT "users".* FROM "users"

def create
	@user = User.new(params[:user])

	if @user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

def update

if @user.update_attributes(params[:user])
---
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["encrypted_password", "f0c029d30cf98662dd2b27c6c0261988a594ce3cda31ea492a0e4b1538ad1f41"], ["updated_at", "2015-04-26 10:01:11.648690"]]